In [1]:
import sqlite3

In [2]:
from sqlite3 import Error

In [3]:
import pandas as pd

In [4]:
#Creating a new db using python

def create_connection(db_file):
    """create db connection to SQLite Db"""
    conn = None
    try:
        conn = sqlite3.connect(db_file)
    except Error as e:
        print(e)
    finally:
        if conn:
            conn.close()

In [5]:
# if __name__=='__main__':
#     create_connection(r"C:\Users\19035\Documents\Data Science - Flatiron\Practice\Current\Coding_Practice\SQL\pythonsqlite.db")

In [6]:
create_connection(r"C:\Users\19035\Documents\Data Science - Flatiron\Practice\Current\Coding_Practice\SQL\pythonsqlite.db")

unable to open database file

In [7]:
conn = sqlite3.connect('pythonsqlite.db')

In [8]:
cur=conn.cursor()

 #### Creating a grocery list : Bananas (4), Peanut Butter (1), Dark Chocolate bars (2)

In [11]:
#create table
cur.execute("""CREATE TABLE groceries (id INTEGER PRIMARY KEY, name TEXT, quantity INTEGER);""")

In [9]:
pd.DataFrame(cur.execute("""SELECT * FROM groceries;""").fetchall())

Empty DataFrame
Columns: []
Index: []

In [10]:
cur.description

(('id', None, None, None, None, None, None),
 ('name', None, None, None, None, None, None),
 ('quantity', None, None, None, None, None, None))

In [11]:
def sql_to_pd(query):
    df = pd.DataFrame(cur.execute(query).fetchall())
    df.columns = [x[0] for x in cur.description]
    return df

In [12]:
cur.execute("""INSERT INTO groceries VALUES (1,"Bananas", 4);""")

In [13]:
sql_to_pd("""SELECT * FROM groceries;""")

   id     name  quantity
0   1  Bananas         4

In [14]:
cur.execute("""INSERT INTO groceries VALUES (2, "Peanut Butter", 1);""")
cur.execute("""INSERT INTO groceries VALUES (3, "Dark Chocolate Bars", 2);""")

In [15]:
sql_to_pd("""SELECT * FROM groceries;""")

   id                 name  quantity
0   1              Bananas         4
1   2        Peanut Butter         1
2   3  Dark Chocolate Bars         2

#### Add column

In [16]:
cur.execute("""ALTER TABLE groceries
                ADD aisle INTEGER;""")

In [17]:
sql_to_pd("""SELECT * FROM groceries;""")

   id                 name  quantity aisle
0   1              Bananas         4  None
1   2        Peanut Butter         1  None
2   3  Dark Chocolate Bars         2  None

In [18]:
cur.execute("""INSERT INTO groceries(aisle)
                VALUES (7)""")

cur.execute("""INSERT INTO groceries(aisle)
                VALUES (2)""")

cur.execute("""INSERT INTO groceries(aisle)
                VALUES (2)""")

In [19]:
sql_to_pd("""SELECT * FROM groceries;""")

   id                 name  quantity  aisle
0   1              Bananas       4.0    NaN
1   2        Peanut Butter       1.0    NaN
2   3  Dark Chocolate Bars       2.0    NaN
3   4                 None       NaN    7.0
4   5                 None       NaN    2.0
5   6                 None       NaN    2.0

#### Delete rows

In [20]:
cur.execute("""DELETE FROM groceries WHERE id=4;""")
cur.execute("""DELETE FROM groceries WHERE id=5;""")
cur.execute("""DELETE FROM groceries WHERE id=6;""")

In [21]:
sql_to_pd("""SELECT * FROM groceries;""")

   id                 name  quantity aisle
0   1              Bananas         4  None
1   2        Peanut Butter         1  None
2   3  Dark Chocolate Bars         2  None

#### Update Value

In [22]:
cur.execute("""UPDATE groceries
                SET aisle = 7
                WHERE id = 1;""")
cur.execute("""UPDATE groceries
                SET aisle = 2
                WHERE id = 2;""")
cur.execute("""UPDATE groceries
                SET aisle = 2
                WHERE id = 3;""")

In [23]:
sql_to_pd("""SELECT * FROM groceries;""")

   id                 name  quantity  aisle
0   1              Bananas         4      7
1   2        Peanut Butter         1      2
2   3  Dark Chocolate Bars         2      2

In [24]:
cur.execute("""INSERT INTO groceries VALUES (4, "Ice Cream", 1, 12);""")
cur.execute("""INSERT INTO groceries VALUES (5, "Cherries", 6, 2);""")
cur.execute("""INSERT INTO groceries VALUES (6, "Chocolate Syrup", 1, 4);""")

In [25]:
sql_to_pd("""SELECT * FROM groceries;""")

   id                 name  quantity  aisle
0   1              Bananas         4      7
1   2        Peanut Butter         1      2
2   3  Dark Chocolate Bars         2      2
3   4            Ice Cream         1     12
4   5             Cherries         6      2
5   6      Chocolate Syrup         1      4

In [26]:
sql_to_pd("""SELECT * FROM groceries ORDER BY aisle;""")

   id                 name  quantity  aisle
0   2        Peanut Butter         1      2
1   3  Dark Chocolate Bars         2      2
2   5             Cherries         6      2
3   6      Chocolate Syrup         1      4
4   1              Bananas         4      7
5   4            Ice Cream         1     12

In [27]:
sql_to_pd("""SELECT * FROM groceries WHERE aisle>5 ORDER BY aisle;""")

   id       name  quantity  aisle
0   1    Bananas         4      7
1   4  Ice Cream         1     12

#### Aggregating Data

In [28]:
cur.execute("""SELECT SUM(quantity) FROM groceries;""").fetchall()

[(15,)]

In [29]:
sql_to_pd("""SELECT SUM(quantity) FROM groceries;""")

   SUM(quantity)
0             15

In [30]:
sql_to_pd("""SELECT MAX(quantity) FROM groceries;""")

   MAX(quantity)
0              6

In [31]:
sql_to_pd("""SELECT name, MAX(quantity) FROM groceries;""")

       name  MAX(quantity)
0  Cherries              6

In [32]:
sql_to_pd("""SELECT SUM(quantity) FROM groceries GROUP BY aisle;""")

   SUM(quantity)
0              9
1              1
2              4
3              1

In [33]:
sql_to_pd("""SELECT aisle, SUM(quantity) FROM groceries GROUP BY aisle;""")

   aisle  SUM(quantity)
0      2              9
1      4              1
2      7              4
3     12              1

### More Complex Queries

In [34]:
cur.execute("""CREATE TABLE excercise_logs (id INTEGER PRIMARY KEY AUTOINCREMENT, type TEXT, minutes INTEGER,
                calories INTEGER, heart_rate INTEGER);""")
cur.execute("""INSERT INTO excercise_logs (type, minutes, calories, heart_rate) VALUES ("biking", 30, 100, 110);""")
cur.execute("""INSERT INTO excercise_logs (type, minutes, calories, heart_rate) VALUES ("biking", 10, 30, 105);""")
cur.execute("""INSERT INTO excercise_logs (type, minutes, calories, heart_rate) VALUES ("dancing", 15, 200, 120);""")

In [35]:
sql_to_pd("""SELECT * FROM excercise_logs""")

   id     type  minutes  calories  heart_rate
0   1   biking       30       100         110
1   2   biking       10        30         105
2   3  dancing       15       200         120

In [36]:
cur.execute("""ALTER TABLE excercise_logs
                RENAME TO exercise_logs;""")

In [37]:
sql_to_pd("""SELECT * FROM exercise_logs""")

   id     type  minutes  calories  heart_rate
0   1   biking       30       100         110
1   2   biking       10        30         105
2   3  dancing       15       200         120

#### AND Keyword

In [38]:
sql_to_pd("""SELECT * FROM exercise_logs WHERE calories>50 AND minutes<30;""")

   id     type  minutes  calories  heart_rate
0   3  dancing       15       200         120

In [39]:
sql_to_pd("""SELECT * FROM exercise_logs WHERE calories>50 OR heart_rate>100;""")

   id     type  minutes  calories  heart_rate
0   1   biking       30       100         110
1   2   biking       10        30         105
2   3  dancing       15       200         120

**And** has precedence over **or** if both are used in the same statement, but can use parenthesis to change the order of evaluation

#### Querying in Subqueries

In [40]:
cur.execute("""INSERT INTO exercise_logs (type, minutes, calories, heart_rate) VALUES ("tree climbing", 30, 70, 90);""")
cur.execute("""INSERT INTO exercise_logs (type, minutes, calories, heart_rate) VALUES ("tree climbing", 25, 72, 80);""")
cur.execute("""INSERT INTO exercise_logs (type, minutes, calories, heart_rate) VALUES ("rowing", 30, 70, 90);""")
cur.execute("""INSERT INTO exercise_logs (type, minutes, calories, heart_rate) VALUES ("hiking", 60, 80, 85);""")

In [41]:
sql_to_pd("""SELECT * FROM exercise_logs""")

   id           type  minutes  calories  heart_rate
0   1         biking       30       100         110
1   2         biking       10        30         105
2   3        dancing       15       200         120
3   4  tree climbing       30        70          90
4   5  tree climbing       25        72          80
5   6         rowing       30        70          90
6   7         hiking       60        80          85

In [42]:
sql_to_pd("""SELECT * FROM exercise_logs WHERE type ="biking";""")

   id    type  minutes  calories  heart_rate
0   1  biking       30       100         110
1   2  biking       10        30         105

In [43]:
sql_to_pd("""SELECT * FROM exercise_logs WHERE type ="biking" OR type="rowing" OR type = "hiking";""")

   id    type  minutes  calories  heart_rate
0   1  biking       30       100         110
1   2  biking       10        30         105
2   6  rowing       30        70          90
3   7  hiking       60        80          85

Instead, use IN operator

##### The **IN** Operator

In [44]:
sql_to_pd("""SELECT * FROM exercise_logs WHERE type IN ("biking","rowing","hiking","tree climbing");""")

   id           type  minutes  calories  heart_rate
0   1         biking       30       100         110
1   2         biking       10        30         105
2   4  tree climbing       30        70          90
3   5  tree climbing       25        72          80
4   6         rowing       30        70          90
5   7         hiking       60        80          85

##### Inverse query

In [45]:
sql_to_pd("""SELECT * FROM exercise_logs WHERE type NOT IN ("biking","rowing","hiking","tree climbing");""")

   id     type  minutes  calories  heart_rate
0   3  dancing       15       200         120

In [46]:
cur.execute("""CREATE TABLE drs_favorites
    (id INTEGER PRIMARY KEY,
    type TEXT,
    reason TEXT);""" )

cur.execute("""INSERT INTO drs_favorites(type, reason) VALUES ("biking", "Improves endurance and flexibility.");""")
cur.execute("""INSERT INTO drs_favorites(type, reason) VALUES ("hiking", "Increases cardiovascular health.");""")

In [47]:
sql_to_pd("""SELECT * FROM drs_favorites""")

   id    type                               reason
0   1  biking  Improves endurance and flexibility.
1   2  hiking     Increases cardiovascular health.

In [48]:
sql_to_pd("""SELECT * FROM exercise_logs WHERE type IN (SELECT type FROM drs_favorites)""")

   id    type  minutes  calories  heart_rate
0   1  biking       30       100         110
1   2  biking       10        30         105
2   7  hiking       60        80          85

In [49]:
sql_to_pd("""SELECT * FROM exercise_logs WHERE type IN (SELECT type FROM drs_favorites WHERE reason = "Increases cardiovascular health.");""")

   id    type  minutes  calories  heart_rate
0   7  hiking       60        80          85

Errors out if not exact match in the string. can also do a non exact match

##### LIKE Operator

In [50]:
sql_to_pd("""SELECT * FROM exercise_logs WHERE type IN (SELECT type FROM drs_favorites WHERE reason LIKE "%cardiovascular%");""")

   id    type  minutes  calories  heart_rate
0   7  hiking       60        80          85

#### Restricting grouped results with HAVING

In [51]:
sql_to_pd("""SELECT type, SUM(calories) FROM exercise_logs GROUP BY type;""")

            type  SUM(calories)
0         biking            130
1        dancing            200
2         hiking             80
3         rowing             70
4  tree climbing            142

In [52]:
sql_to_pd("""SELECT type, SUM(calories) AS total_calories FROM exercise_logs GROUP BY type;""")

            type  total_calories
0         biking             130
1        dancing             200
2         hiking              80
3         rowing              70
4  tree climbing             142

WHERE only filters out individual logs. For aggregate, HAVING

In [53]:
sql_to_pd("""SELECT type, SUM(calories) AS total_calories FROM exercise_logs GROUP BY type HAVING total_calories>150;""")

      type  total_calories
0  dancing             200

In [54]:
sql_to_pd("""SELECT type, AVG(calories) AS average_calories FROM exercise_logs GROUP BY type
                HAVING average_calories>70""")

            type  average_calories
0        dancing             200.0
1         hiking              80.0
2  tree climbing              71.0

Only those activities which have been logged more than once: COUNT

##### COUNT Operator

In [55]:
sql_to_pd("""SELECT type FROM exercise_logs GROUP BY type HAVING COUNT(*)>=2;""")

            type
0         biking
1  tree climbing

#### Calculating results with CASE

In [56]:
cur.execute("""INSERT INTO exercise_logs (type, minutes, calories, heart_rate) VALUES ("dancing", 15, 165, 120);""")

In [57]:
sql_to_pd("""SELECT * from exercise_logs""")

   id           type  minutes  calories  heart_rate
0   1         biking       30       100         110
1   2         biking       10        30         105
2   3        dancing       15       200         120
3   4  tree climbing       30        70          90
4   5  tree climbing       25        72          80
5   6         rowing       30        70          90
6   7         hiking       60        80          85
7   8        dancing       15       165         120

Max heartrate is 220-age

In [58]:
sql_to_pd("""SELECT COUNT(*) from exercise_logs WHERE heart_rate > 220-28;""")

   COUNT(*)
0         0

Target heart rate: 50-90% of max

In [59]:
sql_to_pd("""SELECT COUNT(*) from exercise_logs WHERE heart_rate >= ROUND(0.5*(220-28)) AND heart_rate <= ROUND(0.9*(220-28));""")

   COUNT(*)
0         4

Summary of logs and how many in each zone. But we dont have a column for zones to use group by. Effectively create a column using the **CASE** statement.

In [60]:
sql_to_pd("""SELECT type, heart_rate FROM exercise_logs;""")

            type  heart_rate
0         biking         110
1         biking         105
2        dancing         120
3  tree climbing          90
4  tree climbing          80
5         rowing          90
6         hiking          85
7        dancing         120

In [61]:
sql_to_pd("""SELECT type, heart_rate,
                CASE
                    WHEN heart_rate > 220-28 THEN "above max"
                    WHEN heart_rate>= ROUND(0.9*(220-28)) THEN "above target"
                    WHEN heart_rate>= ROUND(0.5*(220-28)) THEN "within target"
                    ELSE "below target"
                END AS hr_zone
            FROM exercise_logs;""")

            type  heart_rate        hr_zone
0         biking         110  within target
1         biking         105  within target
2        dancing         120  within target
3  tree climbing          90   below target
4  tree climbing          80   below target
5         rowing          90   below target
6         hiking          85   below target
7        dancing         120  within target

In [62]:
sql_to_pd("""SELECT COUNT(*),
                CASE
                    WHEN heart_rate > 220-28 THEN "above max"
                    WHEN heart_rate>= ROUND(0.9*(220-28)) THEN "above target"
                    WHEN heart_rate>= ROUND(0.5*(220-28)) THEN "within target"
                    ELSE "below target"
                END AS hr_zone
            FROM exercise_logs
            GROUP BY hr_zone;""")

   COUNT(*)        hr_zone
0         4   below target
1         4  within target

##### Challenge: GradeBook

In [63]:
cur.execute("""CREATE TABLE student_grades (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT,
    number_grade INTEGER,
    fraction_completed REAL);""")
cur.execute("""INSERT INTO student_grades (name, number_grade, fraction_completed)
    VALUES ("Winston", 90, 0.805);""")
cur.execute("""INSERT INTO student_grades (name, number_grade, fraction_completed)
    VALUES ("Winnefer", 95, 0.901);""")
cur.execute("""INSERT INTO student_grades (name, number_grade, fraction_completed)
    VALUES ("Winsteen", 85, 0.906);""")
cur.execute("""INSERT INTO student_grades (name, number_grade, fraction_completed)
    VALUES ("Wincifer", 66, 0.7054);""")
cur.execute("""INSERT INTO student_grades (name, number_grade, fraction_completed)
    VALUES ("Winster", 76, 0.5013);""")
cur.execute("""INSERT INTO student_grades (name, number_grade, fraction_completed)
    VALUES ("Winstonia", 82, 0.9045);""")

In [64]:
sql_to_pd("""SELECT * FROM student_grades""")

   id       name  number_grade  fraction_completed
0   1    Winston            90              0.8050
1   2   Winnefer            95              0.9010
2   3   Winsteen            85              0.9060
3   4   Wincifer            66              0.7054
4   5    Winster            76              0.5013
5   6  Winstonia            82              0.9045

In [65]:
sql_to_pd("""SELECT name, number_grade,ROUND(fraction_completed*100) AS percent_completed FROM student_grades;""")

        name  number_grade  percent_completed
0    Winston            90               81.0
1   Winnefer            95               90.0
2   Winsteen            85               91.0
3   Wincifer            66               71.0
4    Winster            76               50.0
5  Winstonia            82               90.0

In [66]:
sql_to_pd("""SELECT COUNT(*),
    CASE
        WHEN number_grade > 90 THEN "A"
        WHEN number_grade > 80 THEN "B"
        WHEN number_grade > 70 THEN "C"
        ELSE "F"
    END AS letter_grade
FROM student_grades
GROUP BY letter_grade""")

   COUNT(*) letter_grade
0         1            A
1         3            B
2         1            C
3         1            F

### Relational Queries in SQL

#### JOINing Related tables

In [69]:
cur.execute("""CREATE TABLE students (id INTEGER PRIMARY KEY,
    first_name TEXT,
    last_name TEXT,
    email TEXT,
    phone TEXT,
    birthdate TEXT);""")

cur.execute("""INSERT INTO students (first_name, last_name, email, phone, birthdate)
    VALUES ("Peter", "Rabbit", "peter@rabbit.com", "555-6666", "2002-06-24");""")

cur.execute("""INSERT INTO students (first_name, last_name, email, phone, birthdate)
    VALUES ("Alice", "Wonderland", "alice@wonderland.com", "555-4444", "2002-07-04");""")

#-----------------------------------------------------------------------------------------------------------------

cur.execute("""CREATE TABLE student_grades2 (id INTEGER PRIMARY KEY,
    student_id INTEGER,
    test TEXT,
    grade INTEGER);""")

cur.execute("""INSERT INTO student_grades2 (student_id, test, grade)
    VALUES (1, "Nutrition", 95);""")

cur.execute("""INSERT INTO student_grades2 (student_id, test, grade)
    VALUES (2, "Nutrition", 92);""")

cur.execute("""INSERT INTO student_grades2 (student_id, test, grade)
    VALUES (1, "Chemistry", 85);""")

cur.execute("""INSERT INTO student_grades2 (student_id, test, grade)
    VALUES (2, "Chemistry", 95);""")

In [71]:
sql_to_pd("""SELECT * FROM student_grades2""")

   id  student_id       test  grade
0   1           1  Nutrition     95
1   2           2  Nutrition     92
2   3           1  Chemistry     85
3   4           2  Chemistry     95

In [72]:
# Cross Join

sql_to_pd("""SELECT * FROM student_grades2,students""")

,id,student_id,test,grade,id,first_name,last_name,email,phone,birthdate
0,1,1,Nutrition,95,1,Peter,Rabbit,peter@rabbit.com,555-6666,2002-06-24
1,1,1,Nutrition,95,2,Alice,Wonderland,alice@wonderland.com,555-4444,2002-07-04
2,2,2,Nutrition,92,1,Peter,Rabbit,peter@rabbit.com,555-6666,2002-06-24
3,2,2,Nutrition,92,2,Alice,Wonderland,alice@wonderland.com,555-4444,2002-07-04
4,3,1,Chemistry,85,1,Peter,Rabbit,peter@rabbit.com,555-6666,2002-06-24
5,3,1,Chemistry,85,2,Alice,Wonderland,alice@wonderland.com,555-4444,2002-07-04
6,4,2,Chemistry,95,1,Peter,Rabbit,peter@rabbit.com,555-6666,2002-06-24
7,4,2,Chemistry,95,2,Alice,Wonderland,alice@wonderland.com,555-4444,2002-07-04

In [73]:
# Inner Join Method 1: Implicit Inner Join

sql_to_pd("""SELECT * FROM student_grades2,students
                WHERE student_grades2.student_id=students.id""")

,id,student_id,test,grade,id,first_name,last_name,email,phone,birthdate
0,1,1,Nutrition,95,1,Peter,Rabbit,peter@rabbit.com,555-6666,2002-06-24
1,2,2,Nutrition,92,2,Alice,Wonderland,alice@wonderland.com,555-4444,2002-07-04
2,3,1,Chemistry,85,1,Peter,Rabbit,peter@rabbit.com,555-6666,2002-06-24
3,4,2,Chemistry,95,2,Alice,Wonderland,alice@wonderland.com,555-4444,2002-07-04

In [75]:
# Inner Join Method 2: Explicit Inner Join

sql_to_pd("""SELECT * FROM students
                JOIN student_grades2
                ON students.id = student_grades2.student_id""")

,id,first_name,last_name,email,phone,birthdate,id,student_id,test,grade
0,1,Peter,Rabbit,peter@rabbit.com,555-6666,2002-06-24,1,1,Nutrition,95
1,2,Alice,Wonderland,alice@wonderland.com,555-4444,2002-07-04,2,2,Nutrition,92
2,1,Peter,Rabbit,peter@rabbit.com,555-6666,2002-06-24,3,1,Chemistry,85
3,2,Alice,Wonderland,alice@wonderland.com,555-4444,2002-07-04,4,2,Chemistry,95

In [76]:
sql_to_pd("""SELECT first_name, last_name, email, test, grade FROM students
                JOIN student_grades2
                ON students.id = student_grades2.student_id""")

  first_name   last_name                 email       test  grade
0      Peter      Rabbit      peter@rabbit.com  Nutrition     95
1      Alice  Wonderland  alice@wonderland.com  Nutrition     92
2      Peter      Rabbit      peter@rabbit.com  Chemistry     85
3      Alice  Wonderland  alice@wonderland.com  Chemistry     95

In [77]:
sql_to_pd("""SELECT first_name, last_name, email, test, grade FROM students
                JOIN student_grades2
                ON students.id = student_grades2.student_id
                WHERE grade>90""")

  first_name   last_name                 email       test  grade
0      Peter      Rabbit      peter@rabbit.com  Nutrition     95
1      Alice  Wonderland  alice@wonderland.com  Nutrition     92
2      Alice  Wonderland  alice@wonderland.com  Chemistry     95

What is 2 tables have same column names but different representation?

With such scenario, if we specify the column name in the SELECT statement, it wouldnt know which table to pull the grade from.

Therefore, best practice to prefix the columns in the statement: table_name.column_name

In [79]:
sql_to_pd("""SELECT students.first_name, students.last_name, students.email, student_grades2.test, student_grades2.grade FROM students
    JOIN student_grades2
    ON students.id = student_grades2.student_id
    WHERE grade > 90;""")

  first_name   last_name                 email       test  grade
0      Peter      Rabbit      peter@rabbit.com  Nutrition     95
1      Alice  Wonderland  alice@wonderland.com  Nutrition     92
2      Alice  Wonderland  alice@wonderland.com  Chemistry     95

#### Challenge: Bobby's Hobbies

In [82]:
cur.execute("""CREATE TABLE persons (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT,
    age INTEGER);""")
cur.execute("""INSERT INTO persons (name, age) VALUES ("Bobby McBobbyFace", 12);""")
cur.execute("""INSERT INTO persons (name, age) VALUES ("Lucy BoBucie", 25);""")
cur.execute("""INSERT INTO persons (name, age) VALUES ("Banana FoFanna", 14);""")
cur.execute("""INSERT INTO persons (name, age) VALUES ("Shish Kabob", 20);""")
cur.execute("""INSERT INTO persons (name, age) VALUES ("Fluffy Sparkles", 8);""")


cur.execute("""CREATE table hobbies (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    person_id INTEGER,
    name TEXT);""")
cur.execute("""INSERT INTO hobbies (person_id, name) VALUES (1, "drawing");""")
cur.execute("""INSERT INTO hobbies (person_id, name) VALUES (1, "coding");""")
cur.execute("""INSERT INTO hobbies (person_id, name) VALUES (2, "dancing");""")
cur.execute("""INSERT INTO hobbies (person_id, name) VALUES (2, "coding");""")
cur.execute("""INSERT INTO hobbies (person_id, name) VALUES (3, "skating");""")
cur.execute("""INSERT INTO hobbies (person_id, name) VALUES (3, "rowing");""")
cur.execute("""INSERT INTO hobbies (person_id, name) VALUES (3, "drawing");""")
cur.execute("""INSERT INTO hobbies (person_id, name) VALUES (4, "coding");""")
cur.execute("""INSERT INTO hobbies (person_id, name) VALUES (4, "dilly-dallying");""")
cur.execute("""INSERT INTO hobbies (person_id, name) VALUES (4, "meowing");""")

In [83]:
cur.execute("""INSERT INTO persons (name,age) VALUES ("Sweta Patel",29);""")
cur.execute("""INSERT INTO hobbies (person_id,name) VALUES (6,"reading books and hiking");""")

In [84]:
sql_to_pd("""SELECT persons.name, hobbies.name FROM persons
JOIN hobbies
ON persons.id=hobbies.person_id;""")

                 name                      name
0   Bobby McBobbyFace                   drawing
1   Bobby McBobbyFace                    coding
2        Lucy BoBucie                   dancing
3        Lucy BoBucie                    coding
4      Banana FoFanna                   skating
5      Banana FoFanna                    rowing
6      Banana FoFanna                   drawing
7         Shish Kabob                    coding
8         Shish Kabob            dilly-dallying
9         Shish Kabob                   meowing
10        Sweta Patel  reading books and hiking

In [85]:
sql_to_pd("""SELECT persons.name, hobbies.name FROM persons
JOIN hobbies
ON persons.id=hobbies.person_id
WHERE persons.name = "Bobby McBobbyFace";""")

                name     name
0  Bobby McBobbyFace  drawing
1  Bobby McBobbyFace   coding

#### Joining related tables with left outer joins